import { Product } from "@/lib/types/product";

export const PRODUCTS: Product[] = [
  {
    _id: "1",
    createdAt: new Date(),
    updatedAt: new Date(),
    title: "بردگیم آزول",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    referencePrice: 300000,
    salePrice: 284000,
    stockQuantity: 2,
    properties: {
      "تعداد بازیکنان": "۲ تا ۴ نفر",
      "رده سنی": "۱۲ سال به بالا",
      "زمان بازی": "۱۵ دقیقه",
    },
    images: [
      "https://baziplanet.com/2364-big_default_2x/%D8%A2%D8%B2%D9%88%D9%84-azul.jpg",
    ],
  },
  {
    _id: "2",
    createdAt: new Date(),
    updatedAt: new Date(),
    title: "بردگیم کهربا",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    referencePrice: 300000,
    salePrice: 284000,
    stockQuantity: 2,
    properties: {
      "تعداد بازیکنان": "۲ تا ۴ نفر",
      "رده سنی": "۱۲ سال به بالا",
      "زمان بازی": "۱۵ دقیقه",
    },
    images: [
      "https://baziplanet.com/3094-big_default_2x/%D8%A8%D8%A7%D8%B2%DB%8C-%D8%A7%DB%8C%D8%B1%D8%A7%D9%86%DB%8C-%DA%A9%D9%87%D8%B1%D8%A8%D8%A7-splendor.jpg",
    ],
  },
  {
    _id: "3",
    createdAt: new Date(),
    updatedAt: new Date(),
    title: "بردگیم سایث",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    referencePrice: 300000,
    salePrice: 284000,
    stockQuantity: 2,
    properties: {
      "تعداد بازیکنان": "۲ تا ۴ نفر",
      "رده سنی": "۱۲ سال به بالا",
      "زمان بازی": "۱۵ دقیقه",
    },
    images: [
      "https://baziplanet.com/2027-big_default_2x/%D8%A8%D8%A7%D8%B2%DB%8C-%D8%A7%DB%8C%D8%B1%D8%A7%D9%86%DB%8C-%D8%A7%D8%B3%D8%AA%D9%88%DA%98%DB%8C%D8%AA-dixit.jpg",
    ],
  },
  {
    _id: "4",
    createdAt: new Date(),
    updatedAt: new Date(),
    title: "بردگیم استوژیت",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    referencePrice: 300000,
    salePrice: 284000,
    stockQuantity: 2,
    properties: {
      "تعداد بازیکنان": "۲ تا ۴ نفر",
      "رده سنی": "۱۲ سال به بالا",
      "زمان بازی": "۱۵ دقیقه",
    },
    images: [
      "https://baziplanet.com/887-big_default_2x/%D8%AF%D8%A7%D8%B3-scythe.jpg",
    ],
  },
  {
    _id: "5",
    createdAt: new Date(),
    updatedAt: new Date(),
    title: "بردگیم ماینکرفت",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    referencePrice: 300000,
    salePrice: 284000,
    stockQuantity: 2,
    properties: {
      "تعداد بازیکنان": "۲ تا ۴ نفر",
      "رده سنی": "۱۲ سال به بالا",
      "زمان بازی": "۱۵ دقیقه",
    },
    images: [
      "https://baziplanet.com/6309-big_default/%D8%A8%D8%A7%D8%B2%DB%8C-%D8%A7%DB%8C%D8%B1%D8%A7%D9%86%DB%8C-%D9%85%D8%A7%DB%8C%D9%86%DA%A9%D8%B1%D9%81%D8%AA-%D8%B3%D8%A7%D8%B2%D9%86%D8%AF%DA%AF%D8%A7%D9%86-%D9%88-%D8%B2%DB%8C%D8%B3%D8%AA%DA%AF%D8%A7%D9%87-%D9%87%D8%A7-minecraft-builders-biomes.jpg",
    ],
  },
  {
    _id: "6",
    createdAt: new Date(),
    updatedAt: new Date(),
    title: "بردگیم آزول مدل هزارتو یک بازی فکری و کارت  گیم",
    description:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    referencePrice: 300000,
    salePrice: 284000,
    stockQuantity: 2,
    properties: {
      "تعداد بازیکنان": "۲ تا ۴ نفر",
      "رده سنی": "۱۲ سال به بالا",
      "زمان بازی": "۱۵ دقیقه",
    },
    images: [
      "https://baziplanet.com/2364-big_default_2x/%D8%A2%D8%B2%D9%88%D9%84-azul.jpg",
    ],
  },
];
